In [1]:
people = {
    'first': ['Corey', 'Jane', 'John'],
    'last': ['Schafer', 'Doe', 'Doe'],
    'email': ['coreys@gmail.com', 'janed@gmail.com', 'johnd@gmail.com']
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(people)

In [4]:
df

   first     last             email
0  Corey  Schafer  coreys@gmail.com
1   Jane      Doe   janed@gmail.com
2   John      Doe   johnd@gmail.com

In [6]:
df['full_name'] = df['first'] + ' ' + df['last']

In [7]:
df

   first     last             email      full_name
0  Corey  Schafer  coreys@gmail.com  Corey Schafer
1   Jane      Doe   janed@gmail.com       Jane Doe
2   John      Doe   johnd@gmail.com       John Doe

In [8]:
df.drop(columns = ['first', 'last'])

              email      full_name
0  coreys@gmail.com  Corey Schafer
1   janed@gmail.com       Jane Doe
2   johnd@gmail.com       John Doe

In [9]:
df['full_name'].str.split(' ', expand=True)

       0        1
0  Corey  Schafer
1   Jane      Doe
2   John      Doe

In [10]:
df[['first', 'last']] = df['full_name'].str.split(' ', expand=True)

In [11]:
df

   first     last             email      full_name
0  Corey  Schafer  coreys@gmail.com  Corey Schafer
1   Jane      Doe   janed@gmail.com       Jane Doe
2   John      Doe   johnd@gmail.com       John Doe

In [12]:
df.append({'first': 'Tony'})

TypeError: Can only append a dict if ignore_index=True

In [13]:
df.append({'first': 'Tony'}, ignore_index=True)

   first     last             email      full_name
0  Corey  Schafer  coreys@gmail.com  Corey Schafer
1   Jane      Doe   janed@gmail.com       Jane Doe
2   John      Doe   johnd@gmail.com       John Doe
3   Tony      NaN               NaN            NaN

In [14]:
people = {
    'first': ['Tony', 'Steve'],
    'last': ['Stark', 'Rogers'],
    'email': ['ironman@avenge.com', 'cap@avenge.com']
}
df2 = pd.DataFrame(people)

In [15]:
df2

   first    last               email
0   Tony   Stark  ironman@avenge.com
1  Steve  Rogers      cap@avenge.com

In [16]:
df.append(df2, ignore_index=True)

   first     last               email      full_name
0  Corey  Schafer    coreys@gmail.com  Corey Schafer
1   Jane      Doe     janed@gmail.com       Jane Doe
2   John      Doe     johnd@gmail.com       John Doe
3   Tony    Stark  ironman@avenge.com            NaN
4  Steve   Rogers      cap@avenge.com            NaN

In [17]:
df = df.append(df2, ignore_index=True)

In [18]:
df

   first     last               email      full_name
0  Corey  Schafer    coreys@gmail.com  Corey Schafer
1   Jane      Doe     janed@gmail.com       Jane Doe
2   John      Doe     johnd@gmail.com       John Doe
3   Tony    Stark  ironman@avenge.com            NaN
4  Steve   Rogers      cap@avenge.com            NaN

In [20]:
df.drop(index=4)

   first     last               email      full_name
0  Corey  Schafer    coreys@gmail.com  Corey Schafer
1   Jane      Doe     janed@gmail.com       Jane Doe
2   John      Doe     johnd@gmail.com       John Doe
3   Tony    Stark  ironman@avenge.com            NaN

In [21]:
filt = df['last'] == 'Doe'
df.drop(index=df[filt].index)

   first     last               email      full_name
0  Corey  Schafer    coreys@gmail.com  Corey Schafer
3   Tony    Stark  ironman@avenge.com            NaN
4  Steve   Rogers      cap@avenge.com            NaN